RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f65xxx_66xxx_adc.c
/*********************************************************************************************************//**
 * @file    ht32f65xxx_66xxx_adc.c
 * @version $Rev:: 8260         $
 * @date    $Date:: 2024-11-05 #$
 * @brief   This file provides all the ADC firmware functions.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f65xxx_66xxx_adc.h"

/** @addtogroup HT32F5xxxx_Peripheral_Driver HT32F5xxxx Peripheral Driver
  * @{
  */

/** @defgroup ADC ADC
  * @brief ADC driver modules
  * @{
  */


/* Private constants ---------------------------------------------------------------------------------------*/
/** @defgroup ADC_Private_Define ADC private definitions
  * @{
  */
#define ADC_ENABLE_BIT       (0x00000080)

#if (LIBCFG_ADC1)
#define DUAL_MODE_MASK       (0x00000003)
#endif

#define ADC_SOFTWARE_RESET   (0x00000001)
#define LST_SEQ_SET          (0x0000001F)
#define TCR_SC_SET           (0x00000001)

#define HLST_SEQ_SET         (0x0000001F)
#define HTCR_SC_SET          (0x00000001)

#if (!LIBCFG_ADC_NO_OFFSET_REG)
#define OFR_ADOF_MASK        (0x00000FFF)
#define OFR_ADAL             (1 << 14)
#define OFR_ADOFE            (1 << 15)
#endif

#if (LIBCFG_ADC_MVDDA)
#define ADC_VREF_MVDDAEN     (0x00000100)
#endif
/**
  * @}
  */

/* Global functions ----------------------------------------------------------------------------------------*/
/** @addtogroup ADC_Exported_Functions ADC exported functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief Deinitialize the HT_ADCn peripheral registers to their default reset values.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @retval None
 ************************************************************************************************************/
void ADC_DeInit(HT_ADC_TypeDef* HT_ADCn)
{
  RSTCU_PeripReset_TypeDef RSTCUReset = {{0}};

  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));

  if (HT_ADCn == HT_ADC0)
  {
    RSTCUReset.Bit.ADC0 = 1;
  }
  #if (LIBCFG_ADC1)
  else if (HT_ADCn == HT_ADC1)
  {
    RSTCUReset.Bit.ADC1 = 1;
  }
  #endif
  RSTCU_PeripReset(RSTCUReset, ENABLE);
}

/*********************************************************************************************************//**
 * @brief Reset ADC.
 * @param HT_ADCn: is the selected ADC from the ADC peripherals.
 * @retval None
 ************************************************************************************************************/
void ADC_Reset(HT_ADC_TypeDef* HT_ADCn)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));

  HT_ADCn->RST |= ADC_SOFTWARE_RESET;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the specified ADC.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void ADC_Cmd(HT_ADC_TypeDef* HT_ADCn, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    HT_ADCn->CONV |= ADC_ENABLE_BIT;
  }
  else
  {
    HT_ADCn->CONV &= ~(ADC_ENABLE_BIT);
  }
}

#if (LIBCFG_ADC1)
/*********************************************************************************************************//**
 * @brief Configure the ADC dual mode.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals. (ADC1 only)
 * @param DUAL_X: ADC dual mode configuration.
 *   This parameter can be one of the following values:
 *     @arg DUAL_INDEPENDENT                : Independent mode (dual mode off).
 *     @arg DUAL_CASCADE_REGULAR            : Cascade mode in regular conversion.
 *     @arg DUAL_CASCADE_REGULAR_H_PRIORITY : Cascade mode in regular/high priority conversion.
 * @param HDelayTime: High priority ADC trigger delay.
 *   This parameter must be between 0x00 to 0xFF.
 * @param DelayTime: Regular ADC trigger delay.
 *   This parameter must be between 0x00 to 0xFF.
 * @retval None
 ************************************************************************************************************/
void ADC_DualModeConfig(HT_ADC_TypeDef* HT_ADCn, u32 DUAL_X, u8 HDelayTime, u8 DelayTime)
{
  u32 uTmpReg1, uTmpReg2;
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_ADC_DUAL_MODE(DUAL_X));

  uTmpReg1 = HT_ADCn->CFGR;
  uTmpReg2 = (DUAL_MODE_MASK | 0x00FFFF00);
  uTmpReg1 &= ~uTmpReg2;
  uTmpReg2 = (DUAL_X | HDelayTime << 16 | DelayTime << 8);
  uTmpReg1 |= uTmpReg2;

  HT_ADCn->CFGR = uTmpReg1;
}
#endif

