RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f65xxx_66xxx_adc.c
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_ADC_CHANNEL(ADC_CH_n));
  Assert_Param(IS_ADC_HP_RANK(Rank));
  Assert_Param(IS_ADC_INPUT_SAMPLING_TIME(SampleClock));

  /* config sampling clock of correspond ADC input channel                                                  */
  #if (LIBCFG_ADC_STR_16_17)
  if (ADC_CH_n < 16)
  {
    HT_ADCn->STR[ADC_CH_n] = SampleClock;
  }
  else
  {
    HT_ADCn->STR16[ADC_CH_n - 16] = SampleClock;
  }
  #else
  HT_ADCn->STR[ADC_CH_n] = SampleClock;
  #endif
  
  /* Get the old register value                                                                             */
  #if (LIBCFG_ADC_HLST_0_2)
  tmpreg1 = HT_ADCn->HLST[Rank >> 2];
  #else
  tmpreg1 = HT_ADCn->HLST;
  #endif
  /* Calculate the mask to clear                                                                            */
  tmpreg2 = HLST_SEQ_SET << (8 * (Rank & 0x3));
  /* Clear the old SEQx bits for the selected rank                                                          */
  tmpreg1 &= ~tmpreg2;
  /* Calculate the mask to set                                                                              */
  tmpreg2 = (u32)ADC_CH_n << (8 * (Rank & 0x3));
  /* Set the SEQx bits for the selected rank                                                                */
  tmpreg1 |= tmpreg2;
  /* Store the new register value                                                                           */
  #if (LIBCFG_ADC_HLST_0_2)
  HT_ADCn->HLST[Rank >> 2] = tmpreg1;
  #else
  HT_ADCn->HLST = tmpreg1;
  #endif
}

/*********************************************************************************************************//**
 * @brief Configure the ADC trigger source for regular channels conversion.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @param ADC_TRIG_x:
 *   This parameter can be one of the following values:
 *     @arg ADC_TRIG_SOFTWARE        : S/W trigger
 *     @arg ADC_TRIG_EXTI_n          : where n can be 0 ~ 15
 *     @arg ADC_TRIG_MCTMn_MEVx      : where n can be 0
 *     @arg ADC_TRIG_MCTM0_DMEVx     : where n can be 0*
 *     @arg ADC_TRIG_MCTM0_MEVxDEVz  : where n can be 0
 *     @arg ADC_TRIG_MCTMn_MTO       : where n can be 0
 *     @arg ADC_TRIG_MCTMn_CH0O      : where n can be 0
 *     @arg ADC_TRIG_MCTMn_CH1O      : where n can be 0
 *     @arg ADC_TRIG_MCTMn_CH2O      : where n can be 0
 *     @arg ADC_TRIG_MCTMn_CH3O      : where n can be 0
 *     @arg ADC_TRIG_MCTMn_CHmMEV    : where n can be 0, m can be 0 ~ 3
 *     @arg ADC_TRIG_MCTMn_CHmDEV    : where n can be 0, m can be 0 ~ 3
 *     @arg ADC_TRIG_MCTMn_CHmMDEV   : where n can be 0, m can be 0 ~ 3
 *     @arg ADC_TRIG_MCTMn_CHALLMEV  : where n can be 0
 *     @arg ADC_TRIG_MCTMn_CHALLDEV  : where n can be 0
 *     @arg ADC_TRIG_MCTMn_CHALLMDEV : where n can be 0
 *     @arg ADC_TRIG_BFTMn           : where n can be 0 ~ 1
 *     @arg ADC_TRIG_GPTMn_MTO       : where n can be 0
 *     @arg ADC_TRIG_GPTMn_CH0O      : where n can be 0
 *     @arg ADC_TRIG_GPTMn_CH1O      : where n can be 0
 *     @arg ADC_TRIG_GPTMn_CH2O      : where n can be 0
 *     @arg ADC_TRIG_GPTMn_CH3O      : where n can be 0
 *     @arg ADC_TRIG_CMPn            : where n can be 0 ~ 3
 * @retval None
 ************************************************************************************************************/
void ADC_RegularTrigConfig(HT_ADC_TypeDef* HT_ADCn, u32 ADC_TRIG_x)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_ADC_TRIG(ADC_TRIG_x));

  /* Config external trigger conversion source of regular group                                             */
  HT_ADCn->TCR = ADC_TRIG_x & 0x0000001F;
  HT_ADCn->TSR = ADC_TRIG_x & (~0x0000001F);
}

/*********************************************************************************************************//**
 * @brief Configure the ADC trigger source for high priority channels conversion.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @param ADC_TRIG_x:
 *   This parameter can be one of the following values:
 *     @arg ADC_TRIG_SOFTWARE        : S/W trigger
 *     @arg ADC_TRIG_EXTI_n          : where n can be 0 ~ 15
 *     @arg ADC_TRIG_MCTMn_MEVx      : where n can be 0
 *     @arg ADC_TRIG_MCTM0_DMEVx     : where n can be 0*
 *     @arg ADC_TRIG_MCTM0_MEVxDEVz  : where n can be 0
 *     @arg ADC_TRIG_MCTMn_MTO       : where n can be 0
 *     @arg ADC_TRIG_MCTMn_CH0O      : where n can be 0
 *     @arg ADC_TRIG_MCTMn_CH1O      : where n can be 0
 *     @arg ADC_TRIG_MCTMn_CH2O      : where n can be 0
 *     @arg ADC_TRIG_MCTMn_CH3O      : where n can be 0
 *     @arg ADC_TRIG_MCTMn_CHmMEV    : where n can be 0, m can be 0 ~ 3
 *     @arg ADC_TRIG_MCTMn_CHmDEV    : where n can be 0, m can be 0 ~ 3
 *     @arg ADC_TRIG_MCTMn_CHmMDEV   : where n can be 0, m can be 0 ~ 3
 *     @arg ADC_TRIG_MCTMn_CHALLMEV  : where n can be 0
 *     @arg ADC_TRIG_MCTMn_CHALLDEV  : where n can be 0
 *     @arg ADC_TRIG_MCTMn_CHALLMDEV : where n can be 0
 *     @arg ADC_TRIG_BFTMn           : where n can be 0 ~ 1
 *     @arg ADC_TRIG_GPTMn_MTO       : where n can be 0
 *     @arg ADC_TRIG_GPTMn_CH0O      : where n can be 0
 *     @arg ADC_TRIG_GPTMn_CH1O      : where n can be 0
 *     @arg ADC_TRIG_GPTMn_CH2O      : where n can be 0
 *     @arg ADC_TRIG_GPTMn_CH3O      : where n can be 0
 *     @arg ADC_TRIG_CMPn            : where n can be 0 ~ 3
 * @retval None
 ************************************************************************************************************/
void ADC_HPTrigConfig(HT_ADC_TypeDef* HT_ADCn, u32 ADC_TRIG_x)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_ADC_TRIG(ADC_TRIG_x));

  HT_ADCn->HTCR = ADC_TRIG_x & 0x0000001F;
  HT_ADCn->HTSR = ADC_TRIG_x & (~0x0000001F);
}

