RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f65xxx_66xxx_adc.c
#if (!LIBCFG_ADC_NO_OFFSET_REG)
/*********************************************************************************************************//**
 * @brief Configure the channel data alignment format.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @param ADC_CH_n: the ADC channel to configure
 *   This parameter can be one of the following values:
 *     @arg ADC_CH_n        : ADC Channel x selected
 *     @arg ADC_CH_OPAn     : ADC channel for OPAn
 *     @arg ADC_CH_GND_VREF : ADC GND VREF selected
 *     @arg ADC_CH_VDD_VREF : ADC VDD VREF selected
 * @param ADC_ALIGN_x: ADC_ALIGN_RIGHT or ADC_ALIGN_LEFT
 * @retval None
 ************************************************************************************************************/
void ADC_ChannelDataAlign(HT_ADC_TypeDef* HT_ADCn, u8 ADC_CH_n, ADC_ALIGN_Enum ADC_ALIGN_x)
{
  u32 OFRValue;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_ADC_CHANNEL(ADC_CH_n));
  Assert_Param(IS_ADC_ALIGN(ADC_ALIGN_x));

  OFRValue = HT_ADCn->OFR[ADC_CH_n] & (~(OFR_ADAL));
  OFRValue |= ADC_ALIGN_x;

  HT_ADCn->OFR[ADC_CH_n] = OFRValue;
}

/*********************************************************************************************************//**
 * @brief Configure the offset value for channel offset cancellation.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @param ADC_CH_n: the ADC channel to configure
 *   This parameter can be one of the following values:
 *     @arg ADC_CH_n        : ADC Channel x selected
 *     @arg ADC_CH_OPAn     : ADC channel for OPAn
 *     @arg ADC_CH_GND_VREF : ADC GND VREF selected
 *     @arg ADC_CH_VDD_VREF : ADC VDD VREF selected
 * @param OffsetValue: The offset value
 * @retval None
 ************************************************************************************************************/
void ADC_ChannelOffsetValue(HT_ADC_TypeDef* HT_ADCn, u8 ADC_CH_n, u16 OffsetValue)
{
  u32 OFRValue;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_ADC_CHANNEL(ADC_CH_n));
  Assert_Param(IS_ADC_OFFSET(OffsetValue));

  OFRValue = HT_ADCn->OFR[ADC_CH_n] & (~OFR_ADOF_MASK);
  OFRValue |= (OffsetValue & 0xFFF);
  HT_ADCn->OFR[ADC_CH_n] = OFRValue;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the channel offset cancellation function.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @param ADC_CH_n: the ADC channel to configure
 *   This parameter can be one of the following values:
 *     @arg ADC_CH_n        : ADC Channel x selected
 *     @arg ADC_CH_OPAn     : ADC channel for OPAn
 *     @arg ADC_CH_GND_VREF : ADC GND VREF selected
 *     @arg ADC_CH_VDD_VREF : ADC VDD VREF selected
 * @param NewState: ENABLE DISABLE
 * @retval None
 ************************************************************************************************************/
void ADC_ChannelOffsetCmd(HT_ADC_TypeDef* HT_ADCn, u8 ADC_CH_n, ControlStatus NewState)
{
  u32 OFRValue;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_ADC_CHANNEL(ADC_CH_n));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  OFRValue = HT_ADCn->OFR[ADC_CH_n] & (~(OFR_ADOFE));

  if (NewState == ENABLE)
  {
    OFRValue |= OFR_ADOFE;
  }

  HT_ADCn->OFR[ADC_CH_n] = OFRValue;
}
#endif

#if (LIBCFG_ADC_TRIG_DELAY)
/*********************************************************************************************************//**
 * @brief Configure the ADC Trigger Delay.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals. (ADC1 only)
  * @param HDelayTime: High priority ADC trigger delay.
 *   This parameter must be between 0x00 to 0xFF.
 * @param DelayTime: Regular ADC trigger delay.
 *   This parameter must be between 0x00 to 0xFF.
 * @retval None
 ************************************************************************************************************/
void ADC_TrigDelayConfig(HT_ADC_TypeDef* HT_ADCn, u8 HDelayTime, u8 DelayTime)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));

  HT_ADCn->CFGR = (HDelayTime << 16 | DelayTime << 8);
}
#endif

/*********************************************************************************************************//**
 * @brief Enable or Disable software start of the regular channel conversion of the selected ADC.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void ADC_SoftwareStartConvCmd(HT_ADC_TypeDef* HT_ADCn, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  /* Start Conversion                                                                                       */
  if (NewState != DISABLE)
  {
    HT_ADCn->TSR |= TCR_SC_SET;
  }
  else
  {
    HT_ADCn->TSR &= ~TCR_SC_SET;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable software start of the high priority channel conversion of the selected ADC.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void ADC_HPSoftwareStartConvCmd(HT_ADC_TypeDef* HT_ADCn, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  /* Start Conversion                                                                                       */
  if (NewState != DISABLE)
  {
    HT_ADCn->HTSR |= HTCR_SC_SET;
  }
  else
  {
    HT_ADCn->HTSR &= ~HTCR_SC_SET;
  }
}

